**From the 22 individual school year data files, randomly (using Python) select one file.**

**Let's load Libraries**

In [1]:
import pandas as pd
import random
import numpy as np
from matplotlib import pyplot as plt

In [2]:
dframe= pd.read_csv("MERGED2018_19_PP.csv")

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (9,1725,1726,1727,1728,1729,1743,1815,1816,1817,1818,1823,1824,1830,1831,1879,1880,1881,1882,1883,1884,1885,1886,1887,1888,1889,1890,1891,1892,1893,1894,1895,1896,1897,1898,1909,1910,1911,1912,1913,1957,1958,1959,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,1974,1975,1976,1983,1984) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

**Only read the column "TUITIONFEE_IN" frm this file into a data frame.**

In [3]:
df = pd.read_csv("MERGED2017_18_PP.csv", usecols = ['TUITIONFEE_IN'])

**Find out how many observations this data frame has**

In [4]:
df.shape

(7112, 1)

In [5]:
df.count()

TUITIONFEE_IN    4021
dtype: int64

**Find out how many observations that have missing value. Drop those observations**

In [6]:
df.isnull().any()

TUITIONFEE_IN    True
dtype: bool

**True means that there are some missing or unique values. Let's drop the columns that have zero or unique values. Also checking if it is clean**

In [7]:
clean_df= df.dropna(how='all')

In [8]:
clean_df.shape

(4021, 1)

In [9]:
clean_df.isnull().any()

TUITIONFEE_IN    False
dtype: bool

**False means that it is now clean**

**Calculate the mean of the tuition.**

In [10]:
a = clean_df.mean(axis = 0)

In [11]:
a

TUITIONFEE_IN    15097.328277
dtype: float64

**Randomly select one observation, find out the tuition of that observation**

In [12]:
b = clean_df.sample()

In [13]:
b

      TUITIONFEE_IN
6054        15000.0

In [14]:
a-b

      TUITIONFEE_IN
6054      97.328277

**Randomly select 10 observations, display the tuition of these observation**

In [15]:
c = clean_df.sample(10)

In [16]:
c

      TUITIONFEE_IN
1076        12897.0
6867         6840.0
3716         4613.0
3192        28656.0
1631        43050.0
4896         9774.0
3081        13694.0
1650        28420.0
6889        16300.0
1904        16960.0

**Calculate the average of these 10 observations**

In [17]:
d = c.mean(axis = 0)

In [18]:
d

TUITIONFEE_IN    18120.4
dtype: float64

**Calculate the different between the average tuition of thes 10 observations and the average tuition (mean) off all observations above. Average tution fee for all is saved in variable "a" and the average for 10 random samples are saved in variable "d"**

In [19]:
a-d

TUITIONFEE_IN   -3023.071723
dtype: float64

**Randomly select another 10 observations and repeat the above**

In [20]:
e = clean_df.sample(10)

In [21]:
f = e.mean(axis = 0)

In [22]:
a-f

TUITIONFEE_IN   -3124.771723
dtype: float64

**Randomly select another 10 observation and repeat the above**

In [25]:
g = clean_df.sample(10)

In [26]:
h = g.mean(axis = 0)

In [27]:
a-h

TUITIONFEE_IN    2152.628277
dtype: float64

**Randomly select 20 observations, display the tuition of these observation**

In [28]:
a_20 = clean_df.sample(20)

In [29]:
a_20

      TUITIONFEE_IN
4937         6585.0
6394        19800.0
2298         5670.0
6968        15108.0
3939         1130.0
6504        11000.0
3392         6255.0
5986         7550.0
3885         9456.0
3100        15060.0
2123        47140.0
1320        19256.0
2            6900.0
2287         5120.0
2052         7424.0
462          1400.0
6980        14450.0
3255        16860.0
1216         5664.0
5279        10418.0

**Calculate the average of these 20 observations**

In [30]:
b_20 = a_20.mean(axis = 0)

**Calculate the different between the average tuition of thes 10 observations and the average tuition (mean) off all observations above. The average of 10 observation is stored in the variable "d" and the observation for 20 observation is "b_20"**

In [31]:
d-b_20

TUITIONFEE_IN    2183.4
dtype: float64

**Randomly select another 20 observations and repeat the above.**

In [32]:
c_20 = clean_df.sample(20)

In [33]:
d_20 = c_20.mean(axis = 0)

In [34]:
d-d_20

TUITIONFEE_IN    1875.3
dtype: float64

**Randomly select another 20 observations and repeat the above.**

In [35]:
e_20 = clean_df.sample(20)

In [36]:
f_20 = e_20.mean(axis = 0)

In [37]:
d-f_20

TUITIONFEE_IN    886.05
dtype: float64

**Randomly select 30 observations, display the tuition of these observation.**

In [38]:
a_30 = clean_df.sample(20)

In [39]:
a_30

      TUITIONFEE_IN
3510        45608.0
6664         6750.0
3397         2520.0
1620        54318.0
2813        37230.0
2256         5252.0
563          9546.0
6978        14450.0
6482        18000.0
4789        11250.0
340         14884.0
4964         9770.0
767         25360.0
1758         5335.0
1236         3030.0
1326         4080.0
742          2704.0
2042        24000.0
3378        12970.0
3027        43875.0

**Calculate the average of these 30 observations**

In [40]:
b_30 = a_30.mean(axis = 0)

**Calculate the different between the average tuition of thes 10 observations and the average tuition (mean) off all observations above. The average of 10 observation is stored in the variable "d" and the observation for 20 observation is "b_30"**

In [41]:
d-b_30

TUITIONFEE_IN   -3750.9
dtype: float64

**Randomly select another 30 observations and repeat the above.**

In [42]:
c_30 = clean_df.sample(20)

In [43]:
d_30 = c_30.mean(axis = 0)

In [44]:
d-d_30

TUITIONFEE_IN   -3271.9
dtype: float64

**Randomly select another 30 observations and repeat the above.**

In [45]:
e_30 = clean_df.sample(20)

In [46]:
f_30 = e_30.mean(axis = 0)

In [47]:
d-f_30

TUITIONFEE_IN   -347.85
dtype: float64

**Randomly select x observations, display the tuition of these observations.
Calculate the average of these x observations
Calculate the different between the average tuition of these x observations and the average tuition (mean) off all observations above.
Display the difference.**

In [50]:
for i in range (0,5):
    rval = random.randint(0, 4021)
    cfin = clean_df.sample(rval)
    print("The number of entries chosen to calculate the avg is ",rval)
    davg = cfin.mean(axis = 0)
    print("The average is",davg)
    diff = a-davg
    print("The difference between the total avg and avg of randomly selected entries = ",diff)

The number of entries chosen to calculate the avg is  3113
The average is TUITIONFEE_IN    15252.399936
dtype: float64
The difference between the total avg and avg of randomly selected entries =  TUITIONFEE_IN   -155.071659
dtype: float64
The number of entries chosen to calculate the avg is  1606
The average is TUITIONFEE_IN    14932.122042
dtype: float64
The difference between the total avg and avg of randomly selected entries =  TUITIONFEE_IN    165.206234
dtype: float64
The number of entries chosen to calculate the avg is  411
The average is TUITIONFEE_IN    14465.751825
dtype: float64
The difference between the total avg and avg of randomly selected entries =  TUITIONFEE_IN    631.576452
dtype: float64
The number of entries chosen to calculate the avg is  2579
The average is TUITIONFEE_IN    15131.141915
dtype: float64
The difference between the total avg and avg of randomly selected entries =  TUITIONFEE_IN   -33.813639
dtype: float64
The number of entries chosen to calculate the avg is  778
The average is TUITIONFEE_IN    15020.262211
dtype: float64
The difference between the total avg and avg of randomly selected entries =  TUITIONFEE_IN    77.066066
dtype: float64